(function() {
	'use strict';

	angular
		.module('barebone.other')
		.factory('otherController', otherController);

	otherController.$inject = [];

	/* @ngInject */
	function otherController() {

		var data = [{
			title: 'نمای داخلی',
			path: 'سیستم فراگیر Bose®، یک سیستم صوتی چند جانبه است که ارزش تجربه با رنو تالیسمان را دارد. احساس می کنید که با صدای قوی و متعادل در هر جای کابین خودرو احاطه شده اید. دقت صدا همراه با قدرت و باس واقعی. 13 عدد بلندگو با کارآیی بالا که به شما احساسی شبیه جایگاه VIP در یک کنسرت را می دهد.کوچکترین جزئیات کاملا منتقل می شود. سیستم منحصر به فرد Bose® صدا را با توجه به ویژگی های آکوستیک رنو تالیسمان، باز تولید می نماید. این سیستم مخصوصاً بگونه ای منحصر به فرد طراحی شده است تا سفر خود را با یک صدای موسیقی بی نهایت زنده بخاطر بسپارید.',
			path_1: 'images/other/1.jpg'
			
		}, {
			title: 'نمای داخلی',
			path: 'رنو تالیسمان مجهز به سیستم اخطار دهنده نقاط کور است تا امنیت شما را بالا ببرد. وقتی راهنمای خودرو را روشن می کنید، این سیستم هر خودرویی که وارد نقاط کور شما شود به کمک سنسور های نصب شده روی سپر شناسایی می کند و در آینه ها به شما اخطار می دهد.',
			path_1: 'images/other/2.png'
		}, {
			title: 'نمای داخلی',
			path: 'صندلی های چرمی با سیستم تهویه، ماساژ و گرمایش تا خستگی رانندگی را کاهش دهند.',
			path_1: 'images/other/3.JPG'
		}, {
			title: 'نمای داخلی',
			path: 'رنو تالیسمان سیستمی دارد که جلویی عقب رفتن خودرو در موقع  استارت زدن در سربالایی ها را می گیرد و به شروع حرکت کمک می کند.وقتی سیستم زاویه سربالایی را پیدا کند، برای دو ثانیه ثابت می ماند، تا به شما زمان برای حرکت دهد',
			path_1: 'images/other/4.png'
		}, {
			title: 'نمای داخلی',
			path: 'صندلی های چرمی با سیستم تهویه، ماساژ و گرمایش تا خستگی رانندگی را کاهش دهند.',
			path_1: 'images/other/5.JPG'
		}, {
			title: 'نمای داخلی',
			path: 'رنو تالیسمن، برنده 5 ستاره در تست سال 2015 EURONCAP در این آزمون ارزیابی خودرو ها که در 4 جنبه (محافظت از بزرگسالان سرنشین خودرو، محافظت از کودکان در خودرو، محافظت از عابرین پیاده و تکنولوژی های به کار رفته در خودرو) خودرو ها  را می سنجد،  رنو تالیسمن برنده 5 ستاره شده، یعنی بالا ترین رتبه. طراحان و مهندسین ما بهترین ها را برای شما ایجاد کرده اند. کیسه های هوا، کمربند های ایمنی هوشمند، ضربه گیربرای کاهش شدت ضربه در صورت برخورد با عابرین پیاده  و سیستم های کمکی راننده، به شما کمک می کنند با آرامش خاطر بیشتری رانندگی کنید.',
			path_1: 'images/other/6.png'
		}, {
			title: 'نمای داخلی',
			path: 'آینه دید عقب کرومی، اطمینان حاصل می کند که نور زیاد مانع از دید شما نشود.این آینه در روز موقعی که نور خورشید مانع دید شما شود و در شب هنگامی که نور چراغ جلوی سایر خودرو ها شمارا اذیت کند، تیره می شود.',
			path_1: 'images/other/7.png'
		}, {
			title: 'نمای داخلی',
			path: 'یکی از تکنولوژی های بسیار به روزی که در تالیسمان دیده می شود، هد آپ دیسپلی است . این صفحه شفاف و تمام رنگی با کیفیت بالا که جلوی راننده قرار می گیرد اطلاعات سفر را به راننده به طور کامل نشان می دهد',
			path_1: 'images/other/8.JPG'
		}, {
			title: 'نمای داخلی',
			path: 'رنو تالیسمان، مجهز به موتور  TCE 190  EDC با بازدهی سوخت بسیار بالاست. قدرت 190 اسب بخاری و گیربکس اتوماتیک 7 سرعته دوال کلاچ همراه با حالت دستی، بی نظیر است.با  صندلی های ارگونومیک و گستره ای از تجهیزات نوآورانه و تکنولوژی سطح بالا، راحتی شما تضمین شده است. فضای داخلی وسیع، به آسایش شما کمک می کند.',
			path_1: 'images/other/9.JPG'
		}, {
			title: 'نمای داخلی',
			path: 'با کارت هندزفری جدید رنو تالیسمان، درب های خودرو را هنگامی که دستانتان پر است به راحتی باز کنید. همچنینن، می توانید از سیستم خوشامدگویی تالیسمان استفاده کنید.همچینین موقع خروج از خودرو، در ها به صورت خودکار قفل می شوند، و صدای مخصوص قفل در پخش می شود.',
			path_1: 'images/other/10.png'
		}];

		return data;
	}
		
		
	
	
})();