(function() {
	'use strict';

	angular
		.module('barebone.rlink')
		.factory('rlinkController', rlinkController);

	rlinkController.$inject = [];

	/* @ngInject */
	function rlinkController() {

		var data = [{
			title: 'نمای داخلی',
			path: ' رنو تالیسمان تجربه استفاده از یک صفحه نمایشگر مولتی مدیای بزرگ را به شما پیشنهاد می دهد. پشت غربیلک فرمان را بگیرید و کنترل تمام فرامین خودرو را بطور مستقیم و از طریق تبلت 8.7 اینچی متصل به R-Link2® بدست گیرید. صفحه نمایشگر خانگی را می توان با استفاده از یک سیستم ویجت، سفارشی نموده و بنابراین تمام توابع دلخواه و مورد استفاده را همیشه می توانید با نوک انگشتان لمس کنید. وضعیت صندلی و آینه های دید عقب و پیکربندی 6 وضعیت مختلف را ذخیره کنید. مود Multi-Sense® را انتخاب نمائید. تنظیمات مربوط به فن آوری های کمکی را انجام داده و نمایشگر را برای آرامش کامل ذهن رو به بالا تنظیم نمائید. اجازه دهید نوآوری رنو راهنمای شما باشد.',
			path_1: 'images/R-Link/1.JPG'
			
		}, {
			title: 'نمای داخلی',
			path: ' رنو تالیسمان تجربه استفاده از یک صفحه نمایشگر مولتی مدیای بزرگ را به شما پیشنهاد می دهد. پشت غربیلک فرمان را بگیرید و کنترل تمام فرامین خودرو را بطور مستقیم و از طریق تبلت 8.7 اینچی متصل به R-Link2® بدست گیرید. صفحه نمایشگر خانگی را می توان با استفاده از یک سیستم ویجت، سفارشی نموده و بنابراین تمام توابع دلخواه و مورد استفاده را همیشه می توانید با نوک انگشتان لمس کنید. وضعیت صندلی و آینه های دید عقب و پیکربندی 6 وضعیت مختلف را ذخیره کنید. مود Multi-Sense® را انتخاب نمائید. تنظیمات مربوط به فن آوری های کمکی را انجام داده و نمایشگر را برای آرامش کامل ذهن رو به بالا تنظیم نمائید. اجازه دهید نوآوری رنو راهنمای شما باشد.',
			path_1: 'images/R-Link/2.JPG'
		}];

		return data;
	}
		
		
	
	
})();